I also tried emptying `aws_cli_assume_role_arn`, still same issue.

Here's the plan output for the `aws_autoscaling_group` it wants to create:

```
# module.eks_workers.module.autoscale_group.aws_autoscaling_group.default[0] will be created
  + resource "aws_autoscaling_group" "default" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = "hackers-test-eks3-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Attributes"
              + "propagate_at_launch" = "true"
              + "value"               = "workers"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "hackers-test-eks3-workers"
            },
          + {
              + "key"                 = "Namespace"
              + "propagate_at_launch" = "true"
              + "value"               = "hackers"
            },
          + {
              + "key"                 = "Stage"
              + "propagate_at_launch" = "true"
              + "value"               = "test"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/hackers-test-eks3-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = [
          + "subnet-029f81b5fed6dc6d5",
          + "subnet-0a4795e9e7c8dcde7",
        ]
      + wait_for_capacity_timeout = "10m"
      + wait_for_elb_capacity     = 0

      + launch_template {
          + id      = "lt-03a3309fdd24f2bdd"
          + name    = (known after apply)
          + version = "$Latest"
        }
    }
```

I can't see what wouldn't be a valid launch template.